perf/root.yaml
config:
  environments:
    node:
      target: 'http://node-20180624235018152400000003-1954504012.us-east-1.elb.amazonaws.com'

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: RampUp
      duration: 40
      arrivalRate: 5
      rampTo: 25
    - name: Intensive
      duration: 40
      arrivalRate: 25

scenarios:
  - name: Remote (/remote)
    flow:
      - get:
          url: '/remote'